In [2]:
people = {
    'first': ['Myrna', 'Jane', 'John'],
    'last': ['Horton', 'Doe', 'Doe'],
    'email': ['MyrnaHorton@email.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first    last                  email
0  Myrna  Horton  MyrnaHorton@email.com
1   Jane     Doe      JaneDoe@email.com
2   John     Doe      JohnDoe@email.com

In [6]:
df['full name'] = df['first'] + ' ' + df['last']

In [7]:
df

   first    last                  email     full name
0  Myrna  Horton  MyrnaHorton@email.com  Myrna Horton
1   Jane     Doe      JaneDoe@email.com      Jane Doe
2   John     Doe      JohnDoe@email.com      John Doe

In [8]:
#this doesn't apply changes
df.drop(columns=['first', 'last'])

                   email     full name
0  MyrnaHorton@email.com  Myrna Horton
1      JaneDoe@email.com      Jane Doe
2      JohnDoe@email.com      John Doe

In [9]:
#apply changes
df.drop(columns=['first', 'last'], inplace=True)

In [10]:
df

                   email     full name
0  MyrnaHorton@email.com  Myrna Horton
1      JaneDoe@email.com      Jane Doe
2      JohnDoe@email.com      John Doe

In [11]:
df['full name'].str.split(' ')

0    [Myrna, Horton]
1        [Jane, Doe]
2        [John, Doe]
Name: full name, dtype: object

In [12]:
df[['first', 'last']] = df['full name'].str.split(' ', expand=True)

In [13]:
df

                   email     full name  first    last
0  MyrnaHorton@email.com  Myrna Horton  Myrna  Horton
1      JaneDoe@email.com      Jane Doe   Jane     Doe
2      JohnDoe@email.com      John Doe   John     Doe

In [15]:
df.append({'first': 'Tony'}, ignore_index=True)

                   email     full name  first    last
0  MyrnaHorton@email.com  Myrna Horton  Myrna  Horton
1      JaneDoe@email.com      Jane Doe   Jane     Doe
2      JohnDoe@email.com      John Doe   John     Doe
3                    NaN           NaN   Tony     NaN

In [16]:
people = {
    'first': ['Tone', 'Steve'],
    'last': ['Stark', 'Rogers'],
    'email': ['IronMan@email.com', 'Cap@email.com']
}

In [17]:
df2 = pd.DataFrame(people)

In [18]:
df2

   first    last              email
0   Tone   Stark  IronMan@email.com
1  Steve  Rogers      Cap@email.com

In [24]:
df = df.append(df2, ignore_index=True, sort=True)

In [25]:
df

                   email  first     full name    last
0  MyrnaHorton@email.com  Myrna  Myrna Horton  Horton
1      JaneDoe@email.com   Jane      Jane Doe     Doe
2      JohnDoe@email.com   John      John Doe     Doe
3      IronMan@email.com   Tone           NaN   Stark
4          Cap@email.com  Steve           NaN  Rogers

In [26]:
df.drop(index=4)

                   email  first     full name    last
0  MyrnaHorton@email.com  Myrna  Myrna Horton  Horton
1      JaneDoe@email.com   Jane      Jane Doe     Doe
2      JohnDoe@email.com   John      John Doe     Doe
3      IronMan@email.com   Tone           NaN   Stark

In [28]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                   email  first     full name    last
0  MyrnaHorton@email.com  Myrna  Myrna Horton  Horton
3      IronMan@email.com   Tone           NaN   Stark
4          Cap@email.com  Steve           NaN  Rogers